# 주피터 노트북 사용법
* Shift + Enter 키를 누르면 셀이 실행됩니다.
* Enter 키를 누르면 다시 편집 상태로 돌아갑니다.
* ESC 키를 누르고
    * a 키를 누르면 위에 셀이 추가됩니다.
    * b 키를 누르면 아래에 셀이 추가됩니다. 
    * dd 키를 누르면 셀이 삭제됩니다.
* markdown셀 단축키 : m 
* code 셀 단축키 : y
* 자동완성 기능 : tab
    * 함수에서 shift + Tab 키를 누르면 도움말을 볼 수 있습니다.
         * ?? 를 함수 뒤에 붙이면 파라미터와 예제를 확인할 수 있습니다.

## Simple Tutorial

In [5]:
1+1

2

In [6]:
print("Hello World!")

Hello World!

# Pandas Tutorial
* Pandas는 Python의 대표적인 데이터 분석 라이브러리
* 모든 package, library는 import를 사용하여 파이썬으로 읽어옵니다.

In [8]:
import pandas as pd
# as : alias 로 pd로 줄여서 사용할 수 있습니다.

## Series
* python의 list를 사용하면 pandas에서 제공하는 다양한 기능을 사용할 수 없기 때문에 Pandas의 Series 형태로 바꿔준다

In [10]:
odd = [1,3,5,7,9]  # python list와 같음
odd

[1, 3, 5, 7, 9]

In [14]:
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [21]:
print(pd_odd.mean()) #average
print(pd_odd.max()) #max value
print(pd_odd.min()) #min value
print(pd_odd.sum()) #summation

5.0
9
1
25

## DataFrame
* Series도 판다스에서 매우 중요한 데이터 구조 중 하나이지만,실제 판다스의 핵심이자 판다스에서 가장 많이 사용하는 데이터 구조는 DataFrame입니다. 
* 엑셀이나 구글의 스프레드시트, 내지는 파이썬의 2차원 리스트와 유사합니다.

In [26]:
number = [
    [1, 2, 3], 
    [4, 5, 6], 
    [7, 8, 9]
]
number

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [27]:
number[0]

[1, 2, 3]

#### 기존 python list 형태 확인 (type)

In [29]:
type(number)

list

In [30]:
pd_number = pd.DataFrame(number)
pd_number

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### Pandas DataFrame으로 변경 후 형태 확인

In [33]:
type(pd_number)

pandas.core.frame.DataFrame

#### Pandas DataFrame에서 행or 열을 가져오게 되면 type 은 Series가 됨

In [40]:
type(pd_number[0])

pandas.core.series.Series

In [44]:
#  0 열의 값을 가져옵니다.
pd_number[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [46]:
# 0 행의 값을 가져옵니다.  --> loc : locate
pd_number.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

## DataFrame 생성하기
* Read csv File from the web site

In [52]:
transaction_url = "https://bit.ly/dsa-transaction"
transaction = pd.read_csv(transaction_url)
transaction

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled
7    Ko  2017-01-10    200   canceled

In [53]:
transaction_url = "https://bit.ly/dsa-transaction"
transaction = pd.read_csv(transaction_url, index_col="Name")
# index_col을 지정해주게 되면 위의 예제와 다르게 indxe자체가 지정한 column이 됩니다.
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [54]:
transaction.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [55]:
transaction.columns

Index(['date', 'price', 'state'], dtype='object')

In [57]:
transaction.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

In [61]:
# shift + tab 키 : 도움말
transaction.head()

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled

In [64]:
transaction.tail(2)

            date  price     state
Name
Jang  2017-01-09    600  canceled
Ko    2017-01-10    200  canceled

In [68]:
# date 라는 colum을 Series 형태로 불러오기
transaction["date"].head(1)

Name
Kang    2017-01-01
Name: date, dtype: object

In [73]:
# 컬럼명 바꾸기
transaction.columns = ['date', 'amount', 'result']
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

# 기본 연산

In [82]:
# Average
print("Average :", transaction["amount"].mean())
# min value
print("Min :",transaction["amount"].min())
# max value
print("Max :",transaction["amount"].max())
# sum
print("Sum :",transaction["amount"].sum())

Average : 612.5
Min : 200
Max : 900
Sum : 4900

In [79]:
transaction["amount"].describe()

count      8.000000
mean     612.500000
std      216.712449
min      200.000000
25%      500.000000
50%      650.000000
75%      725.000000
max      900.000000
Name: amount, dtype: float64

In [86]:
transaction["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [87]:
transaction["result"].nunique()

2

In [88]:
# data type 이 string으로 인해 object로 출력됨
transaction["result"].describe()

count             8
unique            2
top       confirmed
freq              5
Name: result, dtype: object

In [89]:
transaction["result"].value_counts()

confirmed    5
canceled     3
Name: result, dtype: int64

In [91]:
# 0 ~ 1 사이 값으로 비율을 normalization 해서 출력할 수 있음.
transaction["result"].value_counts(normalize=True)

confirmed    0.625
canceled     0.375
Name: result, dtype: float64

## 데이터 전처리

In [100]:
transaction["result"] = transaction["result"].replace("confirmed","confirm").replace("canceled","cancel") # method chaining
transaction

            date  amount   result
Name
Kang  2017-01-01     500  confirm
Kim   2017-01-03     700  confirm
Choi  2017-01-03     900  confirm
Park  2017-01-05     800  confirm
Lee   2017-01-07     500   cancel
Yoon  2017-01-09     700  confirm
Jang  2017-01-09     600   cancel
Ko    2017-01-10     200   cancel

In [104]:
transaction["date"].head(1)

Name
Kang    2017-01-01
Name: date, dtype: object

In [110]:
# 기존에 .dt 를 하게 되면 date 컬럼 자체가 object 타입이기 때문에 오류가 발생한다. 
# 따라서 pd.to_datetime 을 통해 data type 을 datetiime 으로 바꾸어 주어야 한다.

transaction["date"] = pd.to_datetime(transaction["date"])

In [116]:
transaction["year"] = transaction["date"].dt.year
transaction["month"] = transaction["date"].dt.month
transaction["day"] = transaction["date"].dt.day

## pandas.Timestamp 에서 날짜에 관련된 함수들을 확인할 수 있음.

In [115]:
transaction.head()

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3
Park 2017-01-05     800  confirm  2017      1    5
Lee  2017-01-07     500   cancel  2017      1    7

## 행렬 접근하기

In [126]:
transaction["date"]

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [123]:
transaction["date", "amount"]
# 두 개 이상의 column을 가져오기 위해서 위 처럼 하면 에러가 난다. 
# 두 개 이상의 column을 가져오기 위해서는  list 형태로 가져와야 한다.

KeyError: ('date', 'amount')

In [124]:
transaction[["date","amount"]]

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

In [127]:
columns = ["date", "amount"]
columns

['date', 'amount']

In [129]:
# 변수로 지정해서 가져올 수 있다. 지금은 column 수가 2개이지만, 100개 이상되면 변수로 지정해서 가져오는 것이 좋음.
transaction[columns]

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

In [132]:
# 하나의 column만 가져오면 Series 형태이고
type(transaction["date"])

pandas.core.series.Series

In [133]:
# 두 개 이상의 column만 가져오면 DataFrame 형태이다.   Dataframe 보다 Series가 속도가 빠르다.
type(transaction[columns])

pandas.core.frame.DataFrame

## 행 데이터 접근하기
* loc == locate 를 사용합니다.
* index 기준 행 데이터에 접근하고 싶다면 iloc 함수를 사용합니다.

In [136]:
transaction.loc["Kang"]

date      2017-01-01 00:00:00
amount                    500
result                confirm
year                     2017
month                       1
day                         1
Name: Kang, dtype: object

In [141]:
names = ["Kang","Kim","Choi"]
transaction.loc[names]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3

In [142]:
transaction.iloc[0]

date      2017-01-01 00:00:00
amount                    500
result                confirm
year                     2017
month                       1
day                         1
Name: Kang, dtype: object

In [144]:
# 여러 행을 가져오고 싶을 때는 항상 리스트로 묶어서 가져오기
transaction.iloc[[0,1,2]]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3

In [148]:
# loc[행]
# loc[행][열]
# loc[행, 열]

transaction.loc["Kang"]["date"]

128 µs ± 1.89 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

## 코드 속도 비교
* %timeit을 사용합니다

In [149]:
# Kang 행을 가져와 데이터 프레임을 만들고 다시 date열을 가져오기 때문에 시간이 많이 걸립니다.
%timeit transaction.loc["Kang"]["date"]

136 µs ± 3.01 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [150]:
# good practice! 실제 데이터 갯수가 많아 진다면 이 방법을 사용하는게 효율적입니다.
%timeit transaction.loc["Kang", "date"]

7.09 µs ± 117 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

## 색인

In [159]:
transaction["date"] == "2017-01-03"

Name
Kang    False
Kim      True
Choi     True
Park    False
Lee     False
Yoon    False
Jang    False
Ko      False
Name: date, dtype: bool

In [169]:
# 색인 한 내용을 다시 데이터 프레임에 넣게 되면 데이터프레임 형태로 나타 낼 수 있습니다
# 즉,  찾으려고자 하는 내용이 true인 값만 데이터프레임 형태로 나타납니다.
transaction[transaction["date"] == "2017-01-03"]

           date  amount   result  year  month  day
Name
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3

In [170]:
transaction[transaction["date"] != "2017-01-03"]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Park 2017-01-05     800  confirm  2017      1    5
Lee  2017-01-07     500   cancel  2017      1    7
Yoon 2017-01-09     700  confirm  2017      1    9
Jang 2017-01-09     600   cancel  2017      1    9
Ko   2017-01-10     200   cancel  2017      1   10

In [171]:
transaction[transaction["amount"]<=500]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Lee  2017-01-07     500   cancel  2017      1    7
Ko   2017-01-10     200   cancel  2017      1   10

In [174]:
date_candidates = ["2017-01-01", "2017-01-05", "2017-01-10"]
transaction[transaction["date"].isin(date_candidates)]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Park 2017-01-05     800  confirm  2017      1    5
Ko   2017-01-10     200   cancel  2017      1   10

In [ ]:
#  ~(물결 표시)를 붙이게 되면 만족하지 않는 행들만 데이터 프레임 형태로 나타낼 수 있습니다.
transaction[~transaction["date"].isin(date_candidates)]

# 여러 조건 비교하기

In [183]:
True and True

True

In [184]:
True and False

False

In [185]:
True or False

True

In [189]:
# python 은  and / or 를 쓰지만, pandas 에서는 &를 씁니다.
# 연산자 우선 순위로 인해 오류가 발생할 수 있으니, 조건에 대해서는 괄호를 잘 씌워주어야 합니다.
transaction[(transaction["amount"] >= 500) & (transaction["result"] == "confirm")]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3
Park 2017-01-05     800  confirm  2017      1    5
Yoon 2017-01-09     700  confirm  2017      1    9

In [190]:
transaction[(transaction["amount"] >= 500) | (transaction["result"] == "confirm")]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3
Park 2017-01-05     800  confirm  2017      1    5
Lee  2017-01-07     500   cancel  2017      1    7
Yoon 2017-01-09     700  confirm  2017      1    9
Jang 2017-01-09     600   cancel  2017      1    9

In [192]:
# 조건을 변수에 담아서 사용하는 방법
high = (transaction["amount"] >= 500)
confirm = (transaction["result"] == "confirm")
transaction[high & confirm]

           date  amount   result  year  month  day
Name
Kang 2017-01-01     500  confirm  2017      1    1
Kim  2017-01-03     700  confirm  2017      1    3
Choi 2017-01-03     900  confirm  2017      1    3
Park 2017-01-05     800  confirm  2017      1    5
Yoon 2017-01-09     700  confirm  2017      1    9

In [193]:
# loc[행]
# loc[행][열]
transaction.loc[transaction["result"] == "confirm","amount"]

Name
Kang    500
Kim     700
Choi    900
Park    800
Yoon    700
Name: amount, dtype: int64

## 컬럼추가 & 수정하기

In [195]:
transaction["card-holder"] = "KB Card" # 값을 넣어주지 않으면 Key-Error가 남.

In [199]:
transaction["order"] = [1,2,3,4,5,6,7,8] # 값을 다르게 넣어줄 때는 행의 갯수와 일치하게 넣어주어야 함.

In [202]:
# 데이터프레임에 새로운 컬럼을 만들며 해당 조건에 만족하는 것을 넣어줄 수 있음.
transaction["VIP"] = transaction["amount"] >= 500

In [203]:
transaction

           date  amount   result  year  month  day card-holder  order    VIP
Name
Kang 2017-01-01     500  confirm  2017      1    1     KB Card      1   True
Kim  2017-01-03     700  confirm  2017      1    3     KB Card      2   True
Choi 2017-01-03     900  confirm  2017      1    3     KB Card      3   True
Park 2017-01-05     800  confirm  2017      1    5     KB Card      4   True
Lee  2017-01-07     500   cancel  2017      1    7     KB Card      5   True
Yoon 2017-01-09     700  confirm  2017      1    9     KB Card      6   True
Jang 2017-01-09     600   cancel  2017      1    9     KB Card      7   True
Ko   2017-01-10     200   cancel  2017      1   10     KB Card      8  False

In [209]:
# 조건에 따라서 없는 컬럼을 지정해주고 새로운 값을 지정해주면 아래와 같이 값이 들어가는 것을 확인할 수 있음.
transaction.loc[transaction["amount"] >= 500,"state"]="VIP"
transaction.loc[transaction["amount"] < 500,"state"]="non-VIP"

In [210]:
transaction

,date,amount,result,year,month,day,card-holder,order,VIP,state
Name,,,,,,,,,,
Kang,2017-01-01,500,confirm,2017,1,1,KB Card,1,True,VIP
Kim,2017-01-03,700,confirm,2017,1,3,KB Card,2,True,VIP
Choi,2017-01-03,900,confirm,2017,1,3,KB Card,3,True,VIP
Park,2017-01-05,800,confirm,2017,1,5,KB Card,4,True,VIP
Lee,2017-01-07,500,cancel,2017,1,7,KB Card,5,True,VIP
Yoon,2017-01-09,700,confirm,2017,1,9,KB Card,6,True,VIP
Jang,2017-01-09,600,cancel,2017,1,9,KB Card,7,True,VIP
Ko,2017-01-10,200,cancel,2017,1,10,KB Card,8,False,non-VIP

## apply
* 함수를 만들고, 데이터프레임의 컬럼을 파라미터로 주어줄 수 있는 함수입니다.
* 중복으로 사용되는 코드들을 함수화 시키면 효율적입니다.

In [217]:
def add(a, b): 
    return a + b

In [218]:
add("Hello"," World!")

'Hello World!'

In [219]:
# 함수에 넘겨주는 파라미터 변수는 판다스의 컬럼명과 일치하지 않아도 됨.
def is_vip(amount):
    if amount >= 500:
        return "VIP"
    else:
        return "non-VIP"

In [220]:
is_vip(500)

'VIP'

In [221]:

transaction["amount"].apply(is_vip)

Name
Kang        VIP
Kim         VIP
Choi        VIP
Park        VIP
Lee         VIP
Yoon        VIP
Jang        VIP
Ko      non-VIP
Name: amount, dtype: object

In [223]:
# is_vip 라는 함수를 특정 컬럼에 적용함.
transaction["state"] = transaction["amount"].apply(is_vip)

In [224]:
transaction

,date,amount,result,year,month,day,card-holder,order,VIP,state
Name,,,,,,,,,,
Kang,2017-01-01,500,confirm,2017,1,1,KB Card,1,True,VIP
Kim,2017-01-03,700,confirm,2017,1,3,KB Card,2,True,VIP
Choi,2017-01-03,900,confirm,2017,1,3,KB Card,3,True,VIP
Park,2017-01-05,800,confirm,2017,1,5,KB Card,4,True,VIP
Lee,2017-01-07,500,cancel,2017,1,7,KB Card,5,True,VIP
Yoon,2017-01-09,700,confirm,2017,1,9,KB Card,6,True,VIP
Jang,2017-01-09,600,cancel,2017,1,9,KB Card,7,True,VIP
Ko,2017-01-10,200,cancel,2017,1,10,KB Card,8,False,non-VIP